Repository: andra26h/BibliotecaApp
Catalog: resources/Resource.*.resx
Languages: ro

source: Actions
ro: Actiune

source: Add new author
ro: Adaugă autor

source: Add new book
ro: Adaugă carte

source: Add new category
ro: Adaugă categorie

source: Address
ro: Adresă

# AddressRequired
source: Address is required
ro: Adresa e obligatorie

# AlreadyBorrowedError
source: Book already borrowed
ro: Cartea este deja împrumutată

source: Author
ro: Autor

# AuthorError
source: An error occured while adding a new author
ro: A apărut o eroare la adăugarea unui nou autor

source: Author name
ro: Numele autorului

# AuthorNameRequired
source: Author name is required
ro: Numele autorului este obligatoriu

# AuthorSucces
source: Author added succesfully
ro: Autorul a fost adăugat cu succes

source: Available Copies
ro: Exemplare disponibile

# AvailableCopiesRequired
source: Available copies is required
ro: Numărul de exemplare este obligatoriu

# BookAddError
source: There was an error when trying to add a new book. Please try again
ro: A apărut o eroare la daugarea cărții. Te rugăm încearcă din nou.

# BookAddGenericError
source: An error occured while processing. Try again later
ro: A apărut o eroare! Încercați mai târziu

# BookAddSuccess
source: The book was added succesfully!
ro: Cartea a fost adăugaată cu succes!

# BookAddValidationError
source: Your data is invalid. Please check the form and try again.
ro: Datele introduse sunt invalide. Te rugăm să verifici formularul și să încerci din nou.

source: Books
ro: Cărți

# BookTitle
source: Title
ro: Titlu

# BookTitleRequired
source: Title is required
ro: Titlul este obligatoriu

source: Borrow
ro: Împrumută

source: Borrow Book
ro: Imprumută carte

source: Borrow Date
ro: Dată împrumut

# BorrowDateRequired
source: Borrow date is required
ro: Data împrumutului este obligatorie

source: Borrowed on
ro: Împrumutată în

# BorrowSuccess
source: The book was borrowed succesfull
ro: Cartea a fost împrumutată cu succes!

source: Category
ro: Categorie

# CategoryError
source: An error occured while adding a new category
ro: A apărut o eroare la adăugarea unei noi categorii

source: Category name
ro: Numele categoriei

# CategoryNameRequired
source: Category name is required
ro: Numele categoriei este obligatoriu

# CategorySucces
source: Category added succesfully
ro: Categoria a fost adăugată cu succes

source: Comment
ro: Comentariu

# CommentRequired
source: Comment is required
ro: Comentariul este obligatoriu

source: Confirm Password
ro: Confirmare parolă

source: Cover Image
ro: Copertă

source: Date Of Birth
ro: Data nașterii

# DateOfBirthRequired
source: Date of birth is required
ro: Data nașterii e obligatorie

source: Delete
ro: Șterge

source: Description
ro: Descriere

source: Download PDF
ro: Descarcă PDF

source: Edit
ro: Editează

source: Edit Book
ro: Modifică cartea

# EmailError
source: Email is not valid
ro: Adresa de email nu este validă.

# EmailExistsError
source: An account with this email already exists
ro: Există deja un cont asociat acestui email

# EmailRequired
source: Email is required
ro: Adresa de email este obligatorie

source: English
ro: Engleză

# ErrorOnBorrow
source: You need to be authenticated to be able to borrow a book!
ro: Trebuie să fiți autentificat pentru a împrumuta o carte!

source: First Name
ro: Prenume

# FirstNameRequired
source: First name is required
ro: Prenumele este obligatoriu

source: Home
ro: Acasă

source: Is Popular?
ro: E popular?

source: Is Recommended?
ro: Recomanzi?

source: Language
ro: Limbă

source: Last Name
ro: Nume de familie

# LastNameRequired
source: Last name is required
ro: Numele de familie este obligatoriu

source: Login
ro: Autentificare

# LoginError
source: Username or password incorrect. Please try again!
ro: Nume de utilizator sau parolă incorectă. Te rugăm să încerci din nou!

source: Logout
ro: Deconectare

# MinLengthPassword
source: Password must be at least 8 characters long.
ro: Parola trebuie să aibă cel puțin 8 caractere.

# NoAvailableCopiesError
source: There are no copies available to borrow!
ro: Nu mai sunt copii disponibile pentru împrumut!

source: No borrowed books
ro: Nu aveți cărți împrumutate

source: Password
ro: Parolă

# PasswordMatch
source: Passwords does not match
ro: Parolele nu se potrivesc.

# PasswordRequired
source: Password is required
ro: Parola este obligatorie

source: Phone Number
ro: Număr de telefon

# PopularBooks
source: The most popular books
ro: Cele mai populare cărți

source: Profile
ro: Profil

source: Rating
ro: Notă

# RatingRequired
source: Rating is required
ro: Nota e obligatorie

# RegExError
source: Password must contain at least one letter and one number.
ro: Parola trebuie să conțină cel puțin o literă și o cifră.

source: Register
ro: Înregistrare

# RegisterError
source: There was an error creating the account
ro: A apărut o eroare la crearea contului:

# RegisterSuccess
source: Succesfully register!
ro: Înregistrare cu succes!

source: Remember Me
ro: Ține-mă minte

source: Return Date
ro: Dată returnare

source: Review date
ro: Data review

# ReviewDateRequired
source: Review date is required
ro: Data review-ului este obligatoriu

source: Role name
ro: Denumire rol

source: Romanian
ro: Română

source: Save changes
ro: Salvează modificările

source: Search
ro: Căutare

source: Search books
ro: Caută cărți

# SelectAuthor
source: Select an author
ro: Selectează un autor

# SelectCategory
source: Select a category
ro: Selectează o categorie

# StatusRequired
source: Status is required
ro: Statusul este obligatoriu

# Title
source: Virtual Library
ro: Bibliotecă Virtuală

# UpdateBookError
source: An error occured while updating the book
ro: A apărut o eroare în timpul actualizării

# UpdateBookSuccess
source: Book updated succesfully!
ro: Cartea a fost actualizată cu succes

source: User profile
ro: Profilul utilizatorului

# UserExistsError
source: User already exists
ro: Deja există un cont asociat acestui utilizator/email

source: Username
ro: Nume utilizator

# UsernameRequired
source: Username is required
ro: Numele de utilizator este obligatoriu

# UserNotFound
source: The user was not found
ro: Utilizatorul nu a fost găsit!

source: Borrowed books
ro: Cărți împrumutate

# DeleteConfirmation
source: Do you want to delete this book?
ro: Sigur vrei să ștergi această carte?
